Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The solution is located in the `resteasy-client-quickstart` link:{quickstarts-tree-url}/resteasy-client-quickstart[directory].
ja_jp: ソリューションは `resteasy-client-quickstart` link:{quickstarts-tree-url}/resteasy-client-quickstart[ディレクトリ] にあります。

source: The solution is located in the `scheduler-quickstart` link:{quickstarts-tree-url}/scheduler-quickstart[directory].
ja_jp: ソリューションは `scheduler-quickstart` link:{quickstarts-tree-url}/scheduler-quickstart[ディレクトリ] にあります。

source: The solution is located in the `scheduler-quickstart` {quickstarts-tree-url}/scheduler-quickstart[directory].
ja_jp: ソリューションは `scheduler-quickstart` {quickstarts-tree-url}/scheduler-quickstart[directory] にあります。

source: The solution is located in the `security-jdbc-quickstart` link:{quickstarts-tree-url}/security-jdbc-quickstart[directory].
ja_jp: ソリューションは `security-jdbc-quickstart` link:{quickstarts-tree-url}/security-jdbc-quickstart[ディレクトリ] にあります。

source: The solution is located in the `security-jdbc-quickstart` {quickstarts-tree-url}/security-jdbc-quickstart[directory].
ja_jp: ソリューションは `security-jdbc-quickstart` {quickstarts-tree-url}/security-jdbc-quickstart[directory] にあります。

source: The solution is located in the `security-jpa-quickstart` {quickstarts-tree-url}/security-jpa-quickstart[directory].
ja_jp: ソリューションは `security-jpa-quickstart` {quickstarts-tree-url}/security-jpa-quickstart[directory] にあります。

source: The solution is located in the `security-jwt-quickstart` link:{quickstarts-tree-url}/security-jwt-quickstart[directory].
ja_jp: ソリューションは `security-jwt-quickstart` link:{quickstarts-tree-url}/security-jwt-quickstart[ディレクトリ] にあります。

source: The solution is located in the `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[directory].
ja_jp: ソリューションは `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[directory] にあります。

source: The solution is located in the `security-keycloak-authorization-quickstart` {quickstarts-tree-url}/security-keycloak-authorization-quickstart[directory].
ja_jp: ソリューションは `security-keycloak-authorization-quickstart` {quickstarts-tree-url}/security-keycloak-authorization-quickstart[directory] にあります。

source: The solution is located in the `security-ldap-quickstart` link:{quickstarts-tree-url}/security-ldap-quickstart[directory].
ja_jp: ソリューションは `security-ldap-quickstart` link:{quickstarts-tree-url}/security-ldap-quickstart[ディレクトリ] にあります。

source: The solution is located in the `security-ldap-quickstart` {quickstarts-tree-url}/security-ldap-quickstart[directory].
ja_jp: ソリューションは `security-ldap-quickstart` {quickstarts-tree-url}/security-ldap-quickstart[directory] にあります。

source: The solution is located in the `security-oauth2-quickstart` link:{quickstarts-tree-url}/security-oauth2-quickstart[directory]. It contains a very simple UI to use the Jakarta REST resources created here, too.
ja_jp: ソリューションは `security-oauth2-quickstart` link:{quickstarts-tree-url}/security-oauth2-quickstart[ディレクトリ] にあります。ここで作成された Jakarta REST リソースを使用するための非常にシンプルな UI も含まれています。

source: The solution is located in the `security-oauth2-quickstart` {quickstarts-tree-url}/security-oauth2-quickstart[directory]. It contains a very simple UI to use the JAX-RS resources created here, too.
ja_jp: ソリューションは `security-oauth2-quickstart` {quickstarts-tree-url}/security-oauth2-quickstart[directory] にあります。ここで作成したJAX-RSリソースを利用するための非常にシンプルなUIも含まれています。

source: The solution is located in the `security-openid-connect-client-quickstart` {quickstarts-tree-url}/security-openid-connect-client-quickstart[directory].
ja_jp: ソリューションは `security-openid-connect-client-quickstart` {quickstarts-tree-url}/security-openid-connect-client-quickstart[ディレクトリー] にあります。

source: The solution is located in the `security-openid-connect-multi-tenancy-quickstart` link:{quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart[directory].
ja_jp: ソリューションは、`security-openid-connect-multi-tenancy-quickstart` link:{quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart[ディレクトリー]にあります。

source: The solution is located in the `security-openid-connect-multi-tenancy-quickstart` {quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart[directory].
ja_jp: ソリューションは、 `security-openid-connect-multi-tenancy-quickstart` {quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart[ディレクトリー] にあります。

source: The solution is located in the `security-openid-connect-quickstart` link:{quickstarts-tree-url}/security-openid-connect-quickstart[directory].
ja_jp: ソリューションは、`security-openid-connect-quickstart` link:{quickstarts-tree-url}/security-openid-connect-quickstart[ディレクトリー] にあります。

source: The solution is located in the `security-openid-connect-quickstart` {quickstarts-tree-url}/security-openid-connect-client-quickstart[directory].
ja_jp: ソリューションは `security-openid-connect-quickstart` {quickstarts-tree-url}/security-openid-connect-client-quickstart[ディレクトリー] にあります。

source: The solution is located in the `security-openid-connect-quickstart` {quickstarts-tree-url}/security-openid-connect-quickstart[directory].
ja_jp: ソリューションは `security-openid-connect-quickstart` {quickstarts-tree-url}/security-openid-connect-quickstart[directory] にあります。

source: The solution is located in the `security-openid-connect-web-authentication-quickstart` link:{quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart[directory].
ja_jp: ソリューションは `security-openid-connect-web-authentication-quickstart` link:{quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart[ディレクトリ] にあります。

source: The solution is located in the `security-openid-connect-web-authentication-quickstart` {quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart[directory].
ja_jp: ソリューションは `security-openid-connect-web-authentication-quickstart` {quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart[directory] にあります。

source: The solution is located in the `security-webauthn-quickstart` link:{quickstarts-tree-url}/security-webauthn-quickstart[directory].
ja_jp: ソリューションは `security-webauthn-quickstart` link:{quickstarts-tree-url}/security-webauthn-quickstart[ディレクトリー] にあります。

source: The solution is located in the `security-webauthn-quickstart` {quickstarts-tree-url}/security-webauthn-quickstart[directory].
ja_jp: ソリューションは、 `security-webauthn-quickstart` {quickstarts-tree-url}/security-webauthn-quickstart[ディレクトリ]に配置されています。

source: The solution is located in the `spring-boot-properties-quickstart` link:{quickstarts-tree-url}/spring-boot-properties-quickstart[directory].
ja_jp: ソリューションは `spring-boot-properties-quickstart` link:{quickstarts-tree-url}/spring-boot-properties-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-boot-properties-quickstart` {quickstarts-tree-url}/spring-boot-properties-quickstart[directory].
ja_jp: このソリューションは `spring-boot-properties-quickstart` {quickstarts-tree-url}/spring-boot-properties-quickstart[directory]にあります。

source: The solution is located in the `spring-data-jpa-quickstart` link:{quickstarts-tree-url}/spring-data-jpa-quickstart[directory].
ja_jp: ソリューションは `spring-data-jpa-quickstart` link:{quickstarts-tree-url}/spring-data-jpa-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-data-jpa-quickstart` {quickstarts-tree-url}/spring-data-jpa-quickstart[directory].
ja_jp: ソリューションは `spring-data-jpa-quickstart` {quickstarts-tree-url}/spring-data-jpa-quickstart[ディレクトリー] にあります。

source: The solution is located in the `spring-data-rest-quickstart` link:{quickstarts-tree-url}/spring-data-rest-quickstart[directory].
ja_jp: ソリューションは `spring-data-rest-quickstart` link:{quickstarts-tree-url}/spring-data-rest-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-data-rest-quickstart` {quickstarts-tree-url}/spring-data-rest-quickstart[directory].
ja_jp: このソリューションは、 `spring-data-rest-quickstart` {quickstarts-tree-url}/spring-data-rest-quickstart[directory]にあります。

source: The solution is located in the `spring-di-quickstart` link:{quickstarts-tree-url}/spring-di-quickstart[directory].
ja_jp: ソリューションは `spring-di-quickstart` link:{quickstarts-tree-url}/spring-di-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-di-quickstart` {quickstarts-tree-url}/spring-di-quickstart[directory].
ja_jp: このソリューションは `spring-di-quickstart` {quickstarts-tree-url}/spring-di-QuickStart[ディレクトリー] にあります。

source: The solution is located in the `spring-scheduled-quickstart` link:{quickstarts-tree-url}/spring-scheduled-quickstart[directory].
ja_jp: ソリューションは `spring-scheduled-quickstart` link:{quickstarts-tree-url}/spring-scheduled-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-scheduled-quickstart` {quickstarts-tree-url}/spring-scheduled-quickstart[directory].
ja_jp: このソリューションは、 `spring-scheduled-quickstart` {quickstarts-tree-url}/spring-scheduled-quickstart[directory]にあります。

source: The solution is located in the `spring-security-quickstart` link:{quickstarts-tree-url}/spring-security-quickstart[directory].
ja_jp: ソリューションは `spring-security-quickstart` link:{quickstarts-tree-url}/spring-security-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-security-quickstart` {quickstarts-tree-url}/spring-security-quickstart[directory].
ja_jp: ソリューションは、 `spring-security-quickstart` {quickstarts-tree-url}/spring-security-quickstart[directory] にあります。

source: The solution is located in the `spring-web-quickstart` link:{quickstarts-tree-url}/spring-web-quickstart[directory].
ja_jp: ソリューションは `spring-web-quickstart` link:{quickstarts-tree-url}/spring-web-quickstart[ディレクトリ] にあります。

source: The solution is located in the `spring-web-quickstart` {quickstarts-tree-url}/spring-web-quickstart[directory].
ja_jp: このソリューションは `spring-web-quickstart` {quickstarts-tree-url}/spring-web-QuickStart[ディレクトリー]にあります。

source: The solution is located in the `stork-automatic-consul-registration-quickstart` link:{quickstarts-tree-url}/stork-automatic-consul-registration-quickstart[directory].
ja_jp: ソリューションは `stork-automatic-consul-registration-quickstart` link:{quickstarts-tree-url}/stork-automatic-consul-registration-quickstart[ディレクトリ] にあります。

source: The solution is located in the `stork-kubernetes-quickstart` link:{quickstarts-tree-url}/stork-kubernetes-quickstart[directory].
ja_jp: ソリューションは `stork-kubernetes-quickstart` link:{quickstarts-tree-url}/stork-kubernetes-quickstart[ディレクトリ] にあります。

source: The solution is located in the `stork-kubernetes-quickstart` {quickstarts-tree-url}/stork-kubernetes-quickstart[directory].
ja_jp: ソリューションは `stork-kubernetes-quickstart` {quickstarts-tree-url}/stork-kubernetes-quickstart[ディレクトリー] に配置されます。

source: The solution is located in the `stork-quickstart` link:{quickstarts-tree-url}/stork-quickstart[directory].
ja_jp: ソリューションは `stork-quickstart` link:{quickstarts-tree-url}/stork-quickstart[ディレクトリ] にあります。

source: The solution is located in the `stork-quickstart` {quickstarts-tree-url}/stork-quickstart[directory].
ja_jp: ソリューションは、 `stork-quickstart` {quickstarts-tree-url}/stork-quickstart[ディレクトリ]にあります。

source: The solution is located in the `tests-with-coverage-quickstart` link:{quickstarts-tree-url}/tests-with-coverage-quickstart[directory].
ja_jp: ソリューションは `tests-with-coverage-quickstart` link:{quickstarts-tree-url}/tests-with-coverage-quickstart[ディレクトリ] にあります。

source: The solution is located in the `tests-with-coverage-quickstart` {quickstarts-tree-url}/tests-with-coverage-quickstart[directory].
ja_jp: ソリューションは `tests-with-coverage-quickstart` {quickstarts-tree-url}/tests-with-coverage-quickstart[directory] にあります。

source: The solution is located in the `validation-quickstart` link:{quickstarts-tree-url}/validation-quickstart[directory].
ja_jp: ソリューションは `validation-quickstart` link:{quickstarts-tree-url}/validation-quickstart[ディレクトリ] にあります。

source: The solution is located in the `validation-quickstart` {quickstarts-tree-url}/validation-quickstart[directory].
ja_jp: ソリューションは `validation-quickstart` {quickstarts-tree-url}/validation-quickstart[directory] にあります。

source: The solution is located in the `vertx-quickstart` link:{quickstarts-tree-url}/vertx-quickstart[directory].
ja_jp: ソリューションは `vertx-quickstart` link:{quickstarts-tree-url}/vertx-quickstart[ディレクトリ] にあります。

source: The solution is located in the `vertx-quickstart` {quickstarts-tree-url}/vertx-quickstart[directory].
ja_jp: このソリューションは `vertx-quickstart` {quickstarts-tree-url}/vertx-quickstart[directory] にあります。

source: The solution is located in the `websockets-next-quickstart` link:{quickstarts-tree-url}/websockets-next-quickstart[directory].
ja_jp: ソリューションは `websockets-next-quickstart` link:{quickstarts-tree-url}/websockets-next-quickstart[ディレクトリ] にあります。

source: The solution is located in the `websockets-quickstart` link:{quickstarts-tree-url}/websockets-quickstart[directory].
ja_jp: ソリューションは `websockets-quickstart` link:{quickstarts-tree-url}/websockets-quickstart[ディレクトリ] にあります。

source: The solution is located in the `websockets-quickstart` {quickstarts-tree-url}/websockets-quickstart[directory].
ja_jp: ソリューションは `websockets-quickstart` {quickstarts-tree-url}/websockets-quickstart[directory] にあります。

source: The solution is located in {quickstarts-tree-url}/optaplanner-quickstart[the `optaplanner-quickstart` directory].
ja_jp: ソリューションは、 {quickstarts-tree-url}/optaplanner-quickstart[`optaplanner-quickstart` ディレクトリー] にあります。

source: The solution is to
ja_jp: 解決策は、以下の通りです。

source: The solution is to activate the request context, the following example shows how to get the roles from an Hibernate with Panache `UserRoleEntity`.
ja_jp: 解決策は、リクエストコンテキストをアクティブにすることです。次の例では、Hibernate with Panache `UserRoleEntity` からロールを取得する方法を示しています。

source: The solution is to use the xref:telemetry-micrometer-to-opentelemetry.adoc[`quarkus-micrometer-opentelemetry`] extension to allow using *Micrometer metrics* and *OpenTelemetry logs and traces* at the same time with a unified output using the OTLP protocol. Manual OpenTelemetry metrics can also be created with this extension and all signals are enabled by default, for convenience.
ja_jp: 解決策として、xref:telemetry-micrometer-to-opentelemetry.adoc[`quarkus-micrometer-opentelemetry`] エクステンションを使用することで、*Micrometer メトリクス* と *OpenTelemetry のログおよびトレース* を同時に利用し、OTLP プロトコルを通じて統一された出力を得ることができます。また、このエクステンションを使用すれば、手動で OpenTelemetry のメトリクスを作成することも可能で、利便性のために、すべてのシグナルがデフォルトで有効になっています。

source: The solution repository located in the `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[directory] contains all of the versions we have worked through in this quickstart guide as well as some additional endpoints that illustrate subresources with injection of ``JsonWebToken``s and their claims into those using the CDI APIs. We suggest that you check out the quickstart solutions and explore the `security-jwt-quickstart` directory to learn more about the {extension-name} extension features.
ja_jp: `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[ディレクトリー] にあるソリューションリポジトリーには、このクイックスタートガイドで使用したすべてのバージョンと、CDI API を使用して挿入された JsonWebToken およびそのクレームを持つサブリソースを示すいくつかの追加のエンドポイントが含まれます。クイックスタートソリューションを確認し、 `security-jwt-quickstart` ディレクトリーを調べて、{extension-name} エクステンションの詳細を確認することをお勧めします。

source: The solution repository located in the `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[directory] contains all the versions we have worked through in this quickstart guide as well as some additional endpoints that illustrate subresources with injection of ``JsonWebToken``s and their claims into those using the CDI APIs. We suggest that you check out the quickstart solutions and explore the `security-jwt-quickstart` directory to learn more about the {extension-name} extension features.
ja_jp: `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[ディレクトリー] にあるソリューションリポジトリーには、このクイックスタートガイドで使用したすべてのバージョンと、CDI API を使用して挿入された JsonWebToken およびそのクレームを持つサブリソースを示すいくつかの追加のエンドポイントが含まれます。クイックスタートソリューションを確認し、 `security-jwt-quickstart` ディレクトリーを調べて、{extension-name} エクステンションの詳細を確認することをお勧めします。

source: The source and target file names are declared in `docs/src/main/asciidoc/telemetry-examples.yaml`:
ja_jp: ソースファイル名とターゲットファイル名は `docs/src/main/asciidoc/telemetry-examples.yaml` で宣言されます。

source: The source cache is located in the `target/sources` folder.
ja_jp: ソースキャッシュは `target/sources` フォルダーにあります。

source: The source code for the `/api/admin` endpoint is also very simple. The main difference here is that we are using a `@RolesAllowed` annotation to make sure that only users granted with the `adminRole` role can access the endpoint:
ja_jp: `/api/admin` エンドポイントのソースコードも非常にシンプルです。ここでの主な違いは、 `adminRole` ロールで付与されたユーザーだけがエンドポイントにアクセスできるように `@RolesAllowed` アノテーションを使用していることです。 :

source: The source code for the `/api/admin` endpoint is also very simple. The main difference here is that we are using a `@RolesAllowed` annotation to make sure that only users granted with the `admin` role can access the endpoint:
ja_jp: `/api/admin` エンドポイントのソースコードも非常にシンプルです。ここでの主な違いは、 `admin` ロールで付与されたユーザーだけがエンドポイントにアクセスできるように `@RolesAllowed` アノテーションを使用していることです:

source: The source code for the `/api/admin` endpoint is also very simple:
ja_jp: `/api/admin` エンドポイントのソースコードも非常にシンプルです。

source: The source code for the `/api/admin` endpoint is similar but instead you use a `@RolesAllowed` annotation to make sure that only users granted the `admin` role can access the endpoint. Add a JAX-RS resource with the following `@RolesAllowed` annotation:
ja_jp: `api/admin` エンドポイントのソースコードも同様ですが、代わりに `@RolesAllowed` アノテーションを使用して、 `admin` ロールを与えられたユーザのみがエンドポイントにアクセスできることを確認します。 JAX-RS リソースを追加して、以下の `@RolesAllowed` アノテーションを付けます:

source: The source code is hosted on <a href="https://github.com/quarkusio/quarkus">GitHub</a>. If you need to report a bug or request a new feature, look for a similar one on our <a href="https://github.com/quarkusio/quarkus/issues">GitHub issue tracker</a>. If you don’t find any, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">create a new issue</a>.
ja_jp: ソースコードは<a href="https://github.com/quarkusio/quarkus">GitHub</a>にホストされています。バグを報告したり、新機能を要望する必要がある場合は、<a href="https://github.com/quarkusio/quarkus/issues">GitHub 課題管理</a>で似た課題がないか探してみてください。見つからなかった場合は、<a href="https://github.com/quarkusio/quarkus/issues/new/choose">新しい課題を作成して下さい</a>。

source: The source code repository of this extension. In GitHub Actions builds, it will be determined automatically. For other GitHub repositories, it can be controlled by setting a `GITHUB_REPOSITORY` environment variable.
ja_jp: このエクステンションのソースコードリポジトリです。GitHub Actions のビルドでは、自動的に決定されます。その他の GitHub リポジトリの場合は、 `GITHUB_REPOSITORY` 環境変数を設定することで制御できます。

source: The source code repository of this extension. Optional, and will often be set automatically by using the `<scm>` information in the pom. In GitHub Actions builds, it will be inferred from the CI environment. For other GitHub repositories, it can be controlled by setting a `GITHUB_REPOSITORY` environment variable.
ja_jp: このエクステンションモジュールのソースコードリポジトリー。オプションで、多くの場合は pom 内の `<scm>` の情報を使って自動的に設定されます。GitHub Actions のビルドでは、CI 環境から推測されます。その他の GitHub リポジトリーの場合は、 `GITHUB_REPOSITORY` 環境変数で指定します。

source: The source code repository of this extension. Optional, and will often be set automatically using the `<scm>` information in the pom. In GitHub Actions builds, it will be inferred from the CI environment. For other GitHub repositories, it can be controlled by setting a `GITHUB_REPOSITORY` environment variable.
ja_jp: このエクステンションモジュールのソースコードリポジトリ。オプションで、多くの場合は pom 内の `<scm>` の情報を使って自動的に設定されます。GitHub Actions のビルドでは、CI 環境から推測されます。その他の GitHub リポジトリの場合は、 `GITHUB_REPOSITORY` 環境変数で指定します。

source: The source file contains the following comment:
ja_jp: ソースファイルには、以下のコメントが記載されています。

source: The source file to be copied is:
ja_jp: コピーされる元ファイルは

source: The source of the problem is that, to ensure binary compatibility, the https://github.com/hub4j/github-api[Hub4j GitHub API] we use in Quarkus GitHub App introduces bridge methods in the bytecode.
ja_jp: 問題の原因は、バイナリ互換性を確保するために、Quarkus GitHub Appで使用している link:https://github.com/hub4j/github-api[Hub4j GitHub API]では、バイトコードにブリッジメソッドを導入していることです。

source: The specific annotation that STM-aware application interfaces must use is `org.jboss.stm.annotations.Transactional`. For example:
ja_jp: STM を意識したアプリケーションインターフェースが使用しなければならない特定のアノテーションは、 `org.jboss.stm.annotations.Transactional` です。例を以下に示します。

source: The sponsor(s) of this extension. Optional, and will sometimes be determined automatically from commit history.
ja_jp: このエクステンションモジュールのスポンサー。オプションであり、コミット履歴から自動的に決定されることもあります。

source: The standard MicroProfile Rest Client properties notation can also be used to configure the client:
ja_jp: 標準のMicroProfile Rest Clientのプロパティ表記を使用して、クライアントを設定することもできます。

source: The standard configuration does not show Quarkus events. We have to do three tasks to see the Quarkus events.
ja_jp: 標準設定では、Quarkus イベントは表示されません。 Quarkus イベントを表示するには、3 つのタスクを実行する必要があります。

source: The start method was coded to return the LRA id and I have used `bash` to save it into an environment variable called `LRA_URL`. The original hello method used the default value of the `end` element of the `@LRA` annotation so if we call that method with an LRA context then the LRA will automatically close when the method finishes:
ja_jp: startメソッドはLRAのIDを返すようにコード化されており、 `bash` を使ってそれを `LRA_URL` という環境変数に保存しています。オリジナルのhelloメソッドは、 `@LRA` アノテーションの `end` 要素のデフォルト値を使用しているため、LRAのコンテキストでこのメソッドを呼び出すと、メソッドの終了時にLRAが自動的にクローズされます。

source: The start of the story
ja_jp: 物語の始まり

source: The start tag can also define parameters. The parameters have optional names. A section may contain several content *blocks*. The "main" block is always present. Additional/nested blocks also start with `#` and can have parameters too - `{#else if item.isActive}`. A section helper that defines the logic of a section can "execute" any of the blocks and evaluate the parameters.
ja_jp: startタグはパラメーターを定義することもできます。パラメーターにはオプションの名前を付けます。1つのセクションには、いくつかのコンテンツ *ブロック* を含めることができます。"main" ブロックは常に存在します。追加/入れ子になったブロックも `#` で始まり、パラメーターを持つことができます - `{#else if item.isActive}` 。セクションのロジックを定義するセクションヘルパーは、任意のブロックを「実行」し、パラメーターを評価することができます。

source: The start tag can also define parameters: `{#if item.isActive}`. Parameters are separated by one or more spaces. However, parameters can have optional names separated by the equals sign prefixed and suffixed with any number of spaces, e.g. `{#let id='Foo'}` and `{#let id = 'Foo'}` are equivalents where the name of the parameter is `id` and the value is `Foo`.
ja_jp: 開始タグはパラメータを定義することもできます： `{#if item.isActive}` . パラメータは1つ以上のスペースで区切られます。 ただし、パラメーターには、任意の数のスペースを接頭辞および接尾辞として付けた等号で区切られたオプションの名前を付けることができます。 `{#let id='Foo'}` と `{#let id = 'Foo'}` は、パラメーターの名前が `id`、値が `Foo` である場合と等価です。

source: The starting point for the first process is the `com.oracle.svm.driver.NativeImages` class. In GraalVM CE distributions, this first process is a binary, so debugging it in the traditional way with a Java IDE is not possible. However, Mandrel distributions (or locally built GraalVM CE instances) keep this as a normal Java process, so you can remote debug this process by adding the `--vm.agentlib:jdwp=transport=dt_socket,server=y,suspend=y,address=*:8000` as an additional build argument, e.g.
ja_jp: 1番目のプロセスのスタートポイントとなるのは、 `com.oracle.svm.driver.NativeImages` クラスです。GraalVM CEのディストリビューションでは、この最初のプロセスはバイナリなので、従来のようにJava IDEを使ってデバッグすることはできません。しかし、Mandrelのディストリビューション（またはローカルにビルドされたGraalVM CEインスタンス）では、これを通常のJavaプロセスとして保持しているため、 `--vm.agentlib:jdwp=transport=dt_socket,server=y,suspend=y,address=*:8000` を追加のビルド引数として追加することで、このプロセスをリモートデバッグすることができます。
